QuestionConfig = {
	{
		question = "如果有良好的学习环境，你认为自己最适合培养成什么专家?", 
		answer1 = "文学家", 
		answer2 = "科学家", 
		answer3 = "军事家",
	},
	{
		question = "你最常阅读哪一类书籍？", 
		answer1 = "历史书", 
		answer2 = "文学书", 
		answer3 = "科技书",
	},
	{
		question = "一群人聊天，你通常会扮演哪一种角色？", 
		answer1 = "仔细聆听", 
		answer2 = "滔滔大论", 
		answer3 = "适时陈述",
	},
	{
		question = "当你正忙于一件事时，你的朋友要求你替他做另一件事，此时你通常。", 
		answer1 = "助人为乐", 
		answer2 = "见机行事", 
		answer3 = "做自己的事情",
	},
	{
		question = "子女成长中，受父母亲的管教的影响很大，你的父母亲管教是属于哪一型？", 
		answer1 = "权威主义", 
		answer2 = "保护照顾", 
		answer3 = "民主型",
	},
	{
		question = "如果跟前只有一个选择，你会选择下列哪一项？", 
		answer1 = "心爱的恋人", 
		answer2 = "继承王位", 
		answer3 = "长生不老",
	},
	{
		question = "你的身份贵为太子，对于身旁的奴仆，你用什么态度对待他们？", 
		answer1 = "仁慈的态度", 
		answer2 = "威严的姿态", 
		answer3 = "平等的心态",
	},
	{
		question = "当京城被攻陷时，敌人直逼大殿而来，眼看一片大好江山，即将在你手中易主，此时你会做出什么行动？", 
		answer1 = "自尽", 
		answer2 = "狼狈的逃跑", 
		answer3 = "同归于尽",
	},
	{
		question = "一国之王关心他们的子民，你认为人民最想要的是什么？", 
		answer1 = "经济带来的富裕生活", 
		answer2 = "社会安定，享受天伦", 
		answer3 = "国家强盛的荣誉感",
	},
	{
		question = "依你的看法，哪一种学术思想最合适君主时代的统治理念？", 
		answer1 = "法家思想", 
		answer2 = "儒家思想", 
		answer3 = "道家思想",
	},
	{
		question = "一位你信赖的将领，不幸背叛了你。你是如何决定处置方式？", 
		answer1 = "视才能而决定", 
		answer2 = "了解背叛原因之再处置", 
		answer3 = "一律斩首",
	},
	{
		question = "你是一位年老体衰的皇帝，已不像往年那般勤于劳动。这时你会将掌管国家的大任交给谁？", 
		answer1 = "自己的儿子", 
		answer2 = "信任的老臣", 
		answer3 = "有领导力的人",
	},
	{
		question = "百姓的生活有时跟地方官的作位息息相关，哪一型的人你会指派他担任地方行政长官?", 
		answer1 = "行事魄力型", 
		answer2 = "和善待人型", 
		answer3 = "思想细密型",
	},
	{
		question = "如果你是一位君主，对于身旁的伴侣，你希望？", 
		answer1 = "只要一位珍爱的妻子。", 
		answer2 = "可以有两位以上的爱人。", 
		answer3 = "拥有三千佳丽。",
	},
	{
		question = "当你身为皇帝，在统治国家时，你最重视哪一点？", 
		answer1 = "管理的才能", 
		answer2 = "军事的强大", 
		answer3 = "百姓的生活",
	},
	{
		question = "如果你的国家军力强大，对于接壤的国家，你会有什么样的动作？", 
		answer1 = "军事占领", 
		answer2 = "外交屈服", 
		answer3 = "互不侵犯",
	},
}


