
-- mark 后宫初始
var __reg4 = random(6) + 16;
var __reg5 = random(后宫美女最大为) + 1;
if (__reg2 == 0) 
{
    __reg3 = {id: undefined, 称呼: 所有后宫名称[__reg2], 名字: _root.新皇后名字, 能力: 92, 经验: 210, 年龄: __reg4, 状态: 0, 头像: _root.新皇后头像, 爱: 500, 孕: 0, 病: 0};
}
else if (__reg2 == 6) 
{
    __reg3 = {id: undefined, 称呼: 所有后宫名称[__reg2], 名字: "萧忆茹", 能力: 90, 经验: 60, 年龄: __reg4, 状态: 0, 头像: 32, 爱: 140, 孕: 0, 病: 0};
}

-- mark 随机安排筛选
if (主角.后宫[__reg3].名字 !== undefined) 
{
    if (0 != (主角.后宫[__reg3].病 == 0) & 0 != (主角.后宫[__reg3].孕 == 0)) 
    {
        随机翻牌数据.push(主角.后宫[__reg3]);
    }
}
if (随机翻牌数据.length <= 0) 
{
    _root.小提示("后宫没有合适的妃子");
    return;
}
-- mark 点击提示
if (this._parent.属性.病 !== 0) 
{
    _root.小提示("娘娘生病，不能伺候皇上了。");
    return;
}
if (this._parent.属性.孕 !== 0) 
{
    _root.小提示("娘娘怀孕，不能伺候皇上了。");
    return;
}
function 提示后宫的具体状态(对象)
{
    if (对象.属性.孕 !== 0) 
    {
        对象._parent.attachMovie("后宫提示小面板", "后宫提示小面板", 95000, {_x: 对象._x + 77, _y: 对象._y + 32});
        对象._parent.后宫提示小面板.文本.text = "娘娘怀有龙胎，正在静养。";
        return;
    }
    if (对象.属性.病 !== 0) 
    {
        对象._parent.attachMovie("后宫提示小面板", "后宫提示小面板", 95000, {_x: 对象._x + 77, _y: 对象._y + 32});
        对象._parent.后宫提示小面板.文本.text = "娘娘身体不适，正在静养。";
    }
}

-- mark 文字提示
if (参数 == 1)    --安排宫女
{
    if (对象.能力 > 92) 
    {
        所有美人图.后宫对话.文本.htmlText = 颜色代码(对象.名字, "7402C1") + " 第一次侍奉皇上。\n";
    }
    else if (对象.能力 == 91) 
    {
        所有美人图.后宫对话.文本.htmlText = 颜色代码(对象.名字, "010298") + " 第一次侍奉皇上。\n";
    }
    else if (0 != 对象.能力 > 85 & 0 != (对象.id !== undefined)) 
    {
        所有美人图.后宫对话.文本.htmlText = 颜色代码(对象.名字, "CC0000") + " 第一次侍奉皇上。\n";
    }
    else if (对象.id === undefined) 
    {
        所有美人图.后宫对话.文本.htmlText = 对象.名字 + " 第一次侍奉皇上。\n";
    }
    else 
    {
        所有美人图.后宫对话.文本.htmlText = 颜色代码(对象.名字, "003300") + " 第一次侍奉皇上。\n";
    }
}
else 
{
    所有美人图.后宫对话.文本.htmlText = "皇上临幸了" + 对象.称呼 + "：" + 对象.名字 + "。\n";
}
if (对象.年龄 > 38) 
{
    _root.主角.快乐 = _root.主角.快乐 + 5;
    if (_root.主角.快乐 > 100) 
    {
        _root.主角.快乐 = 100;
    }
    所有美人图.后宫对话.文本.htmlText = "皇上前往了" + 颜色代码(对象.称呼, "ff0000") + "娘娘宫中休息。";
}
else 
{
    _root.主角.健康 = _root.主角.健康 - 1;
    if (random(10) > 1) 
    {
        _root.主角.快乐 = _root.主角.快乐 + 10;
    }
    else 
    {
        _root.主角.快乐 = _root.主角.快乐 + 20;
        所有美人图.后宫对话.文本.htmlText = 所有美人图.后宫对话.文本.htmlText + "很愉快。";
    }
    if (_root.主角.快乐 > 100) 
    {
        _root.主角.快乐 = 100;
    }
}    
-- mark 属性值改变
var __reg10 = 对象.能力 + Math.round(对象.经验 / 2);
对象.爱 = 对象.爱 + 4;
对象.经验 = 对象.经验 + 1;
主角.体力 = 主角.体力 + __reg10;

-- mark 是否怀孕，月数，男宠
var __reg2 = random(15);
if (对象.id !== undefined) 
{
    if (0 != 对象.id >= 45 & 0 != 对象.id <= 57) 
    {
        __reg2 = 10;
    }
}
if (__reg2 < 3) 
{
    if (对象.年龄 < 38) 
    {
        对象.孕 = 8;
    }
}