class 数据库.外部小贴士 {
	public function 执行():Void {
		var 小贴士 = [];
		小贴士.push("《皇帝成长计划》希望你游戏愉快。");
		小贴士.push("本次你培养的将是皇帝。");
		小贴士.push("比目鱼感谢您一路支持。");
		小贴士.push("后宫可以恢复快乐。");
		小贴士.push("金龙殿可以恢复健康。");
		小贴士.push("本游戏断断续续制作了三年。");
		小贴士.push("比目鱼成长系列游戏第四部。");
		小贴士.push("防止刺客暗杀，可以经常巡逻。");
		小贴士.push("国库的钱虽然多，请计划使用。");
		小贴士.push("更多事件和功能会陆续更新。");
		小贴士.push("早朝只能一大早进入。");
		小贴士.push("你有一辈子时间来控制本游戏的主角。");
		小贴士.push("本游戏目前还属于测试版阶段。");
		小贴士.push("清蒸比目鱼一点都不好吃。");
		小贴士.push("看着游戏一点点成长，感谢你。");
		小贴士.push("感谢龙井，醉卧，红颜，战魔等人倾力测试。");
		小贴士.push("游戏官方论坛，倾听您的建议。");
		小贴士.push("炼丹以后建议先让太监试看看。");
		小贴士.push("不是每个皇帝都需要征服世界。");
		小贴士.push("后宫名妃的出现，取决于你的RP。");
		小贴士.push("每年进贡，都会进贡珍贵药材。");
		小贴士.push("虽然游戏很简陋，但是一点都不简单。");
		小贴士.push("“醉卧灬美人膝丶” 是个好兄弟。");
		小贴士.push("或许做个皇帝并不容易。");
		小贴士.push("本游戏不打算配任何音乐。");
		小贴士.push("齐家 治国 平天下");
		小贴士.push("后宫虽快乐，请注意身体。");
		小贴士.push("到现在，已数不清更新多少次了。");
		小贴士.push("尽量能够模拟到细节，但这也仅仅只是游戏。");
		小贴士.push("三年制作历程，只为让你感受到这款游戏。");
		小贴士.push("我想对轩辕春秋说“你没完成的游戏，我完成了！”");
		小贴士.push("一个皇帝，一座皇城，你全部的故事。");
		小贴士.push("你对游戏的建议，因此游戏有了你的血液。");
		小贴士.push("你看到的这款游戏，来自我们的共同努力。");
		小贴士.push("手机用户最佳分辨率 800*480 ");
		小贴士.push("感谢“小米”对于成长系列的支持");
		小贴士.push("【我们正在成长】求扩散");
		小贴士.push("比目鱼仍将坚守策略游戏开发");
		小贴士.push("【存档在晚上得紫宸殿】");
		小贴士.push("【频繁进行存读档，可能会减少寿命】");
		小贴士.push("《皇帝成长计划》是个很有爱的游戏。");
		小贴士.push("我们跟你一样，喜欢历史。");
		//
		小贴士.push("比目鱼的第四部养成类游戏。");
		小贴士.push("看似简单的游戏，做起来却不容易。");
		小贴士.push("本游戏在制作两年时间里重做三次。");
		小贴士.push("吏户礼兵刑工，六部可以协助皇上处理国家大事。");
		小贴士.push("吏部主要管理官员事务。");
		小贴士.push("礼部主要管理外交事务。");
		小贴士.push("兵部主要管理战争事务。");
		小贴士.push("刑部主要管理律法事务。");
		小贴士.push("户部主要管理民生事务。");
		小贴士.push("青炉房，可以用外国的贡品进行炼制。");
		小贴士.push("紫辰殿，可以主要处理后宫事宜。");
		小贴士.push("健康很重要，别太劳累了。");
		小贴士.push("妃子怀孕一年后可以生产。");
		小贴士.push("城市的级别，以人口和建筑数量决定。");
		小贴士.push("治安低的时候，可以帮地方建设衙门。");
		小贴士.push("安定低的时候，可以帮地方建设寺庙。");
		小贴士.push("好的大将军，战争时候能够得到体现。");
		小贴士.push("地方总兵的野心与忠诚，可能会叛乱。");
		小贴士.push("威望可以通过行宫与战争提升。");
		小贴士.push("向太后请安，可以增加道德值。");
		//
		小贴士.push("壮丁是国家之根本。");
		小贴士.push("地方建设保障地区稳定。");
		小贴士.push("支持比目鱼，请到4399支持正版。");
		小贴士.push("请不要再破解了。开发两年时间，实在不容易。");
		小贴士.push("【本游戏】4399独家更新。");
		小贴士.push("本游戏由【统一牛肉面】冠名播出。");
		//
		_root.小贴士 = 小贴士;
	}
}