class 数据库.外部子女信息 {
	public function 执行():Void {
		_root.皇家名字组合库 = ["弘", "景", "祁", "毓", "承", "宪", "正", "德", "敬", "豪", "民", "奋", "忠", "荣", "俊", "武", "临", "翰", "博", "硕", "康", "宝", "宜", "润", "禄", "礼", "福", "询", "思", "旭", "胤", "定", "嘉", "秉", "仁", "和", "廉", "嗣", "安", "崇", "佑", "益", "建", "乾", "祚", "恭", "恪", "肃", "裕", "兴", "尚", "新", "铭", "明", "宗", "瑞", "启", "雍", "平", "允", "文", "遵", "祖", "训", "钦", "武", "君", "胜", "顺", "道", "宜", "逢", "吉", "师", "良", "善", "用", "晟", "尚", "志", "公", "诚", "秉", "惟", "怀", "敬", "谊", "存", "辅", "嗣", "资", "廉", "直", "匡", "时", "永", "信", "敦", "高", "瞻", "祁", "见", "佑", "厚", "载", "翊", "常", "由", "慈", "和", "怡", "伯", "仲", "简", "靖", "迪", "先", "贤", "能", "长", "可", "庆", "睿", "智", "实", "堪", "宗", "养", "期", "渊", "雅", "寅", "思", "复", "会", "通"];
		///
		_root.皇家名字女字 = ["昭", "文", "温", "沁", "韵", "芸", "念", "芝", "贤", "羽", "钰", "庚", "锦", "年", "婉", "华", "兰", "如", "珩", "浅", "瑶", "雅", "敏", "斯", "倩", "元", "卿", "盛", "桃", "惠", "慧", "虹", "静", "语", "治", "夏", "秋", "丽", "淑", "珍", "莹", "晶", "雨", "艺", "仪", "书", "涵", "幸", "歆", "馨", "诏", "萌", "孟", "济", "阳", "画", "贝", "玲", "莎", "歌", "婷", "楚", "意"];
		//
		_root.性情 = ["文静", "勤劳", "勇敢", "善良", "贤惠", "老实", "诚实", "忠厚", "热情", "好客", "开朗", "豪放", "爽直", "豪爽", "直爽", "温柔", "谦虚", "自信", "坚强", "憨厚", "谨慎", "朴素", "乐观", "孝顺", "执著", "幽默", "活泼", "顽强", "实在", "孤癖", "小器", "庸俗", "骄傲", "奢侈", "放荡", "愚蠢", "无信", "懒惰", "懦弱", "寡言", "狡猾", "奸诈", "虚伪", "轻浮", "贪厌", "刁蛮", "才华"];
		//
	}
}