class 数据库.外部游戏说明 {
	public function 执行():Void {
		_root.游戏说明 = "六年前，轩辕就放弃了重制这款游戏。\n本人不自量力，重新翻制。\n希望能把前辈的这款游戏做好。\n\n\n-------我们的其他游戏介绍，以及QQ群号码---------\n\n不知不觉过了3年了，也做了三十几个游戏了。\n3年里发生很多事，走过来却是不容易。\n策略游戏个人制作挺困难的。\n我尽量坚持每年出一部成长系列游戏。\n感谢大家能继续支持我。";
		_root.制作人员 = "参与制作人员：\n美工：日刀口\n程序：比目鱼动画\n界面：ZOUOU";
		//
		var 开发手记 = [];
		导入开发手记(开发手记,"“轩辕春秋，这游戏我来完成吧。”");
		导入开发手记(开发手记,"上面这句话是三年前写下的。");
		导入开发手记(开发手记,"怎么样也想不到一款游戏花了我三年多时间。");
		导入开发手记(开发手记,"");
		导入开发手记(开发手记,"");
		导入开发手记(开发手记,"2010年9月8日。晚上，开始制作《皇帝成长计划》。");
		导入开发手记(开发手记,"10.9.8处理素材。设置片头。制作片头资料。");
		导入开发手记(开发手记,"9.9优化之前的取名系统，取的名字将会更加正常。");
		导入开发手记(开发手记,"9.10制作名单排列系统，似乎还算顺利。");
		导入开发手记(开发手记,"9.20《巨星成长计划》发布。");
		导入开发手记(开发手记,"9.28《巨星成长计划》2.3发布。");
		导入开发手记(开发手记,"10.2《美少女成长计划》程序重写进展顺利。");
		导入开发手记(开发手记,"10.3《美少女成长计划》新程序制作，事件减少冲突的可能，可以加更多的事件。");
		导入开发手记(开发手记,"增加道具店来访，以及存档。");
		导入开发手记(开发手记,"10.4暂时搁置《美少女成长计划》，新游戏《公主换装秀》发布。");
		导入开发手记(开发手记,"10.21《海贼王塔防》发布。");
		导入开发手记(开发手记,"10.24《恶龙狂想曲》游戏引擎进一步优化。《美少女成答题问》发布。");
		导入开发手记(开发手记,"10.28《海贼王塔防》3.5发布，修整BUG以及开放更多道具。");
		导入开发手记(开发手记,"10.6暂停所有项目，休息。一年了，累了。");
		导入开发手记(开发手记,"10.11调整状态。《皇帝成长计划》继续制作。");
		导入开发手记(开发手记,"10.12优化人物数据库，更好的对名单进行排列。");
		导入开发手记(开发手记,"10.13周末，进行大地图资讯制作，以及名声以及经济系统的设定制作。");
		导入开发手记(开发手记,"2011年6月7日，重新整理去年写的程序，《皇帝成长计划》继续制作。");
		导入开发手记(开发手记,"2011年12月2日，重新整理半年前写的程序。界面改成800*400。并重写程序。");
		导入开发手记(开发手记,"12.3重新修改片头部分程序。");
		导入开发手记(开发手记,"12.4重新制作上朝的细节。");
		导入开发手记(开发手记,"12.5制作皇宫里学习的程序。");
		导入开发手记(开发手记,"12.6制作皇后学习程序和属性的刷动。");
		导入开发手记(开发手记,"12.8修改皇宫的细节。优化画面。");
		导入开发手记(开发手记,"12.9修改成一年四季，一季两回合。制作宫殿里的部分。");
		导入开发手记(开发手记,"12.7制作宫殿里的一些程序。");
		导入开发手记(开发手记,"12.10制作优化宫殿里的画面。");
		导入开发手记(开发手记,"12.11制作皇宫的学习部分图片和显示。");
		导入开发手记(开发手记,"12.12制作皇宫里的一些细节和调整。制作几个可进入的房间。");
		导入开发手记(开发手记,"12.13更新皇后成长计划一些细节。");
		导入开发手记(开发手记,"12.14皇后成长计划重新修改黑龙程序和剧情。");
		导入开发手记(开发手记,"12.15修改皇后成长计划里的事件逻辑。制作新的事件。");
		导入开发手记(开发手记,"12.16皇后成长计划1.9更新。");
		导入开发手记(开发手记,"12.17策划制作新的装扮类游戏，公主装扮秀年前准备出最后一版。");
		导入开发手记(开发手记,"12.18继续制作皇帝成长计划，重新修改宫殿，和更改新的数据结构。重新制作官职信息读取排列。");
		导入开发手记(开发手记,"12.19制作招募士兵和民夫。");
		导入开发手记(开发手记,"12.20制作调整官职和封爵，科考。");
		导入开发手记(开发手记,"12.21制作税收部分和士兵武器购买部分，以及修改一些BUG。");
		导入开发手记(开发手记,"12.22制作小提示文本逻辑和户口普查等部分内容。");
		导入开发手记(开发手记,"2012年，5月2日，接着制作游戏。");
		导入开发手记(开发手记,"5.3手术之后出现术后综合症，折腾了两个月。");
		导入开发手记(开发手记,"5.4制作细节功能。");
		导入开发手记(开发手记,"5.8制作部分功能和修改每月的收入表。");
		导入开发手记(开发手记,"5.9修改部分面板。");
		导入开发手记(开发手记,"5.10制作贸易和科举。");
		导入开发手记(开发手记,"5.11制作后宫的部分细节和修改。");
		导入开发手记(开发手记,"5.12制作青炉房部分程序。");
		导入开发手记(开发手记,"5.13重新修改收入表。");
		导入开发手记(开发手记,"5.14制作各个城市的AI和收入。");
		导入开发手记(开发手记,"5.14修改后宫程序和BUG。");
		导入开发手记(开发手记,"5.15制作怀孕相关。");
		导入开发手记(开发手记,"5.16修改时辰推进。");
		导入开发手记(开发手记,"5.17制作名臣表和美女。");
		导入开发手记(开发手记,"5.18制作修改太监汇报事件。");
		导入开发手记(开发手记,"5.19制作修改外交相关。");
		导入开发手记(开发手记,"5.20休息一天。");
		导入开发手记(开发手记,"5.21处理事件素材图形，并调试。");
		导入开发手记(开发手记,"5.22修改科举部分程序。");
		导入开发手记(开发手记,"5.23制作修改祭祀部分。");
		导入开发手记(开发手记,"5.24修改炼丹程序。");
		导入开发手记(开发手记,"5.25部分功能进行修改。");
		导入开发手记(开发手记,"5.26去除中央补助和地方调动功能。");
		导入开发手记(开发手记,"5.27简化战争逻辑。");
		导入开发手记(开发手记,"5.28《封神太子2》进入倒计时。");
		导入开发手记(开发手记,"6.1儿童节，带孩子出去玩。");
		导入开发手记(开发手记,"6.2请假一天，休息一下。");
		导入开发手记(开发手记,"6.3继续休息。");
		导入开发手记(开发手记,"6.4制作威望逻辑，行宫功能开启。");
		导入开发手记(开发手记,"6.5调试其他功能。");
		导入开发手记(开发手记,"6.6事件功能改进。");
		导入开发手记(开发手记,"6.7修改人物属性。");
		导入开发手记(开发手记,"6.8制作各种难度及其逻辑。");
		导入开发手记(开发手记,"8.4更新到1.797");
		导入开发手记(开发手记,"2013年，1月1日，《封神太子外传》发布。");
		导入开发手记(开发手记,"2013年，3月7日，重新整理代码，准备更新。");
		//
		var 新的开发手记 = "";
		for (var i = 0; i<开发手记.length; i++) {
			新的开发手记 += 开发手记[i]+"\n";
		}
		_root.开发手记 = 新的开发手记;
		//
	}
	public function 导入开发手记(开发手记, 文本):Void {
		开发手记.push(文本);
	}
}