class 数据库.外部所有情诗 {
	public function 执行():Void {
		var 所有情诗 = [];
		所有情诗.push("美人卷珠帘，深坐颦蛾眉。 但见泪痕湿，不知心恨谁。 ");
		所有情诗.push("望夫处，江悠悠，化为石，不回头。 山头日日风复雨，行人归来石应语。 ");
		所有情诗.push("人道海水深，不抵相思半。 海水尚有涯，相思渺无畔。 携琴上高楼，楼虚月华满。 弹著相思曲，弦肠一时断。  ");
		所有情诗.push("相思似海深，旧事如天远。泪滴千千万万行，更使人、愁肠断。要见无因见，拚了终难拚。若是前生未有缘，待重结、来生愿。  ");
		所有情诗.push("我住长江头，君住长江尾。日日思君不见君，共饮长江水。此水几时休，此恨何时已。只愿君心似我心，定不负相思意");
		所有情诗.push("恨君不似江楼月，南北东西，南北东西，只有相随无别离。 恨君却似江楼月，暂满还亏，暂满还亏，待到团圆是几时？ ");
		所有情诗.push("众里寻他千百度，蓦然回首，那人却在灯火阑珊处。");
		所有情诗.push("花自飘零水自流，一种相思、两处闲愁。此情无计可消除，才下眉头、却上心头。 ");
		所有情诗.push("天不老、情难绝，心似双丝网，中有千千结。夜过也，东窗未白孤灯灭。");
		所有情诗.push("去年元夜时，花市灯如昼；月上柳梢头，人约黄昏后。今年元夜时，月与灯依旧； 不见去年人，泪湿春衫袖。");
		所有情诗.push("何处合成愁，离人心上秋。");
		所有情诗.push("相思相见知何日，此时此夜难为情。");
		所有情诗.push("去年今日此门中，人面桃花相映红；人面不知何处去，桃花依旧笑春风。");
		所有情诗.push("南浦凄凄别，西风袅袅秋；一看肠一断，好去莫回头。 ");
		所有情诗.push("在天愿作比翼鸟，在地愿为连理枝； 天长地久有时尽，此恨绵绵无绝期！");
		所有情诗.push("借问江潮与海水，何似君情与妾心？相信不如潮有信，相思始觉海水深！");
		所有情诗.push("夜长酒阑灯花长，灯花落地复落床：似我别泪三四行，滴群君满坐之衣裳。 与君别后泪痕在，年年著衣心莫改。");
		所有情诗.push("多情却似总无情，唯觉樽前笑不成； 蜡烛有泪还惜别，为君垂泪到天明。");
		所有情诗.push("东边日出西边雨，道是无晴却有晴？");
		所有情诗.push("还君明珠双泪垂，恨不相逢未嫁时！");
		所有情诗.push("梧桐树，三更雨，不道离情正苦。一叶叶，一声声，空阶滴到明！");
		所有情诗.push("千万恨，恨极在天涯。山月不知心里事，水风空落眼前花，摇曳碧云斜。");
		所有情诗.push("梳洗罢，独倚上江楼。过尽千帆皆不是，斜晖脉脉水悠悠，断肠白蘋洲！");
		所有情诗.push("直道相思了无益，未妨惆怅是清狂！");
		所有情诗.push("身无彩凤双飞翼，心有灵犀一点通。");
		所有情诗.push("知我意、感君怜，此情须问天！");
		所有情诗.push("剪不断、理还乱、是离愁；别是一番滋味在心头！");
		所有情诗.push("人生自是有情痴，此恨不关风与月！");
		所有情诗.push("聚散苦匆匆，此恨无穷！今年花胜去年红。可惜明年花更好，知与谁同？");
		所有情诗.push("人有悲欢离合，月有阴晴圆缺，此事古难全。但愿人长久，千里共婵娟！");
		所有情诗.push("死生契阔，与子成说。持子之手，与子偕老 。");
		所有情诗.push("君当作磐石，妾当作蒲苇。蒲苇韧如丝，磐石无转移。");
		所有情诗.push("曾经沧海难为水，除缺巫山不是云。取次花丛懒回顾，半缘修道半缘君。");
		所有情诗.push("此情可待成追忆,只是当时已惘然。");
		所有情诗.push("笑渐不闻声渐消，多情却被无情恼。");
		所有情诗.push("相顾无言,唯有泪千行。");
		所有情诗.push("现世无由见，除非梦里逢。醒来襟袖湿，疑是露华浓。");
		所有情诗.push("一生一代一双人，争教两处销魂。相思相望不相亲，天为谁春？");
		所有情诗.push("前仇难泯龙心怨，痴心寻药不畏险。情深动能传九霄，终得灵药救华年。");
		所有情诗.push("谁家翩翩少年郎，修行未满恋海棠。无情不似多情苦，梦断溪谷白发长。");
		//
		_root.所有情诗 = 所有情诗;
	}
}