class 数据库.外部阵营信息 {
	public function 执行():Void {
		_root.外交状态 = ["交战", "停战", "厌恶", "冷淡", "一般", "友善", "盟友", "属国"];
		var 阵营 = Array();
		阵营.push({id:0, 士兵:25, 状态:1, 跳:5, 联姻:0, 外交:5, 装备:1, 名称:"高丽", 城:[], 友好度:80, 贸易额:0, 贸易年数:0, 兵种:"高丽长枪兵", 战力:4});
		阵营.push({id:1, 士兵:31, 状态:1, 跳:4, 联姻:0, 外交:2, 装备:3, 名称:"日本", 城:[], 友好度:70, 贸易额:0, 贸易年数:0, 兵种:"带刀武士", 战力:7});
		阵营.push({id:2, 士兵:40, 状态:1, 跳:6, 联姻:0, 外交:2, 装备:4, 名称:"突厥", 城:[], 友好度:0, 贸易额:0, 贸易年数:0, 兵种:"突厥骑弓兵", 战力:9});
		阵营.push({id:3, 士兵:40, 状态:1, 跳:1, 联姻:0, 外交:3, 装备:3, 名称:"印度", 城:[], 友好度:50, 贸易额:0, 贸易年数:0, 兵种:"印度象兵", 战力:9});
		阵营.push({id:4, 士兵:30, 状态:1, 跳:6, 联姻:0, 外交:3, 装备:3, 名称:"契丹", 城:[], 友好度:10, 贸易额:0, 贸易年数:0, 兵种:"游骑兵", 战力:8});
		阵营.push({id:5, 士兵:30, 状态:1, 跳:7, 联姻:0, 外交:4, 装备:2, 名称:"南诏", 城:[], 友好度:50, 贸易额:0, 贸易年数:0, 兵种:"长弓手", 战力:5});
		阵营.push({id:6, 士兵:50, 状态:1, 跳:3, 联姻:0, 外交:4, 装备:3, 名称:"吐蕃", 城:[], 友好度:40, 贸易额:0, 贸易年数:0, 兵种:"狩猎骑兵", 战力:6});
		阵营.push({id:7, 士兵:80, 状态:1, 跳:2, 联姻:0, 外交:4, 装备:4, 名称:"罗马", 城:[], 友好度:50, 贸易额:0, 贸易年数:0, 兵种:"方阵长枪兵", 战力:13});
		阵营.push({id:8, 士兵:12, 状态:1, 跳:7, 联姻:0, 外交:5, 装备:1, 名称:"中国", 城:[], 友好度:0, 贸易额:0, 贸易年数:0, 兵种:"高丽长枪兵", 战力:5});
		阵营.push({id:9, 士兵:20, 状态:1, 跳:7, 联姻:0, 外交:0, 装备:2, 名称:"叛军", 城:[], 友好度:0, 贸易额:0, 贸易年数:0, 兵种:"叛军朴刀兵", 战力:4});
		//
		_root.阵营 = 阵营;
		var 所有城池 = Array();
		所有城池.push({id:0, 类型:"海河型", 名称:"罗马", 人口:800, 邻居:[3, 1, 2], 归属:7});
		所有城池.push({id:1, 类型:"海河型", 名称:"波斯", 人口:200, 邻居:[0, 3, 4, 5, 6, 2], 归属:7});
		所有城池.push({id:2, 类型:"平原型", 名称:"大食", 人口:300, 邻居:[0, 1], 归属:7});
		所有城池.push({id:3, 类型:"高山型", 名称:"西突厥", 人口:100, 邻居:[0, 1, 4, 8, 9, 10], 归属:2});
		所有城池.push({id:4, 类型:"海河型", 名称:"吐火罗", 人口:100, 邻居:[3, 1, 5, 8], 归属:6});
		所有城池.push({id:5, 类型:"高山型", 名称:"小勃律", 人口:100, 邻居:[4, 1, 6, 7, 8], 归属:6});
		所有城池.push({id:6, 类型:"高山型", 名称:"天竺", 人口:600, 邻居:[1, 5, 7, 29], 归属:3});
		所有城池.push({id:7, 类型:"高山型", 名称:"吐蕃", 人口:600, 邻居:[9, 8, 5, 6, 29, 14], 归属:6});
		所有城池.push({id:8, 类型:"平原型", 名称:"疏勒", 人口:100, 邻居:[3, 4, 5, 7, 9], 归属:6});
		所有城池.push({id:9, 类型:"草丘型", 名称:"龟兹", 人口:100, 邻居:[10, 3, 8, 7, 11], 归属:6});
		所有城池.push({id:10, 类型:"草丘型", 名称:"高昌", 人口:100, 邻居:[3, 9, 11], 归属:2});
		所有城池.push({id:11, 类型:"草丘型", 名称:"回纥", 人口:100, 邻居:[10, 9, 7, 14, 13, 12, 21], 归属:2});
		所有城池.push({id:12, 类型:"高山型", 名称:"东突厥", 人口:300, 邻居:[11, 13, 17, 18, 20, 21], 归属:2});
		所有城池.push({id:13, 类型:"草丘型", 名称:"陇右", 人口:500, 邻居:[11, 14, 15, 16, 17, 12], 归属:8});
		所有城池.push({id:14, 类型:"平原型", 名称:"吐谷浑", 人口:300, 邻居:[11, 7, 29, 15, 13], 归属:6});
		所有城池.push({id:15, 类型:"高山型", 名称:"剑南", 人口:500, 邻居:[14, 13, 16, 27, 29], 归属:8});
		所有城池.push({id:16, 类型:"平原型", 名称:"山南", 人口:500, 邻居:[15, 27, 25, 24, 18, 17, 13], 归属:8});
		所有城池.push({id:17, 类型:"平原型", 名称:"关内", 人口:600, 邻居:[12, 13, 16, 18], 归属:8});
		所有城池.push({id:18, 类型:"平原型", 名称:"河东", 人口:700, 邻居:[12, 17, 16, 24, 19], 归属:8});
		所有城池.push({id:19, 类型:"平原型", 名称:"河北", 人口:600, 邻居:[18, 20, 22, 24], 归属:8});
		所有城池.push({id:20, 类型:"草丘型", 名称:"奚", 人口:300, 邻居:[21, 12, 18, 19, 22, 23], 归属:2});
		所有城池.push({id:21, 类型:"草丘型", 名称:"铁勒", 人口:500, 邻居:[11, 12, 20, 23], 归属:2});
		所有城池.push({id:22, 类型:"平原型", 名称:"高丽", 人口:400, 邻居:[20, 19, 23], 归属:0});
		所有城池.push({id:23, 类型:"草丘型", 名称:"契丹", 人口:500, 邻居:[20, 22], 归属:4});
		所有城池.push({id:24, 类型:"海河型", 名称:"河南", 人口:500, 邻居:[19, 18, 16, 25], 归属:8});
		所有城池.push({id:25, 类型:"海河型", 名称:"淮南", 人口:600, 邻居:[24, 26, 16, 27], 归属:8});
		所有城池.push({id:26, 类型:"海河型", 名称:"日本", 人口:700, 邻居:[22, 25], 归属:1});
		所有城池.push({id:27, 类型:"平原型", 名称:"江南", 人口:700, 邻居:[25, 16, 15, 28, 29], 归属:8});
		所有城池.push({id:28, 类型:"平原型", 名称:"岭南", 人口:500, 邻居:[29, 27], 归属:8});
		所有城池.push({id:29, 类型:"草丘型", 名称:"南诏", 人口:300, 邻居:[6, 7, 14, 15, 28], 归属:5});
		//
		_root.所有城池 = 所有城池;
	}
}