class 数据库.外部国内外名人 {
	public function 执行():Void {
		_root.所有国内的大名人 = ["天地会 陈近南", "洪兴 陈浩南", "名剑山庄 易继风", "天狼星 田伯光", "海鲜商会 比目鱼", "大内侍卫 云锦鹤", "巨鲸帮 肥老虎", "广东十虎 方世玉", "天公将军 张角", "香帅 楚留香", "天理会 张恩", "青龙帮 奇岩谷", "连云堡 雷震东", "日月教主 任我行", "飞凤镖局 苏小小", "龙门镖局 黄天霸", "万里镖局 贾必真", "镇远镖局 骆震山", "呼保义 宋江", "京城商贾 钱万三", "连环坞 风残云", "七煞教 鬼见愁", "五凤刀 凤姑", "神拳门 霹雳手", "鹰爪门 上官海 ", "八极门 丁发祥", "韦陀门林渤海", "长乐帮 贝海石", "铁剑门 玉真子", "武当派 张三丰", "峨嵋派 灭绝师太", "古墓派 林朝英", "恒山派 郭襄", "华山派 令狐冲", "嵩山派 左冷禅", "泰山派 天门道长", "衡山派 刘正风", "少林 空闻", "昆仑派 何太冲", "丐帮 鲁有脚", "全真教 王重阳", "大理 段正淳", "逍遥派 天山童姥", "桃花岛 黄药师", "白驼山庄 欧阳客", "昆仑山 何足道", "金乌派 青雪莲", "血刀门 海血仙", "明教 方腊", "摩天崖 谢烟客", "同福客栈 白展堂", "西藏密宗 金轮", "天山 袁士霄", "三才门 王培生", "青帮 杜月笙", "白莲教 徐寿辉", "三联帮 蓝鲸", "东星 骆驼", "比目鱼美工 张昭", "浪客 剑心", "合通钱庄 沈良", "钱云赌场 钱六"];
		//
	}
}