class 数据库.外部丞相的话 {
	public function 执行():Void {
		var 丞相的提示话 = [];
		丞相的提示话.push("本游戏是比目鱼的第四部养成类游戏。");
		丞相的提示话.push("看似简单的游戏，做起来却不容易。");
		丞相的提示话.push("本游戏在制作两年时间里重做三次。");
		丞相的提示话.push("吏户礼兵刑工，六部可以协助皇上处理国家大事。");
		丞相的提示话.push("吏部主要管理官员事务。");
		丞相的提示话.push("礼部主要管理外交事务。");
		丞相的提示话.push("兵部主要管理战争事务。");
		丞相的提示话.push("刑部主要管理律法事务。");
		丞相的提示话.push("户部主要管理民生事务。");
		丞相的提示话.push("青炉房，可以用外国的贡品进行炼制。");
		丞相的提示话.push("紫辰殿，可以主要处理后宫事宜。");
		丞相的提示话.push("健康很重要，皇上一定要注意安排。别太劳累了。");
		丞相的提示话.push("妃子怀孕一年后可以生产。");
		丞相的提示话.push("城市的级别，以人口和建筑数量决定。");
		丞相的提示话.push("治安低的时候，可以帮地方建设衙门。");
		丞相的提示话.push("安定低的时候，可以帮地方建设寺庙。");
		丞相的提示话.push("好的大将军，战争时候能够得到体现。");
		丞相的提示话.push("地方总兵的野心与忠诚，可能会叛乱。");
		丞相的提示话.push("威望可以通过行宫与战争提升。");
		丞相的提示话.push("向太后请安，可以增加道德值。");
		//
		_root.丞相的提示话=丞相的提示话
		//
	}
}