class 数据库.外部地方建设信息 {
	public function 执行():Void {
		_root.地方建筑全部 = ["寺庙", "市集", "城墙", "衙门", "义仓", "校场", "民心", "行宫"];
		var 国家建筑全部 = [];
		//
		国家建筑全部.push(["长城", 0, 20, 200, 1]);
		国家建筑全部.push(["城墙", 0, 20, 200, 2]);
		国家建筑全部.push(["大佛寺", 0, 20, 200, 3]);
		国家建筑全部.push(["大运河", 0, 20, 200, 4]);
		国家建筑全部.push(["东厂", 0, 20, 200, 5]);
		国家建筑全部.push(["竞技场", 0, 20, 200, 6]);
		国家建筑全部.push(["陵寝", 0, 20, 200, 7]);
		国家建筑全部.push(["洛口仓", 0, 20, 200, 8]);
		国家建筑全部.push(["圆明园", 0, 20, 200, 10]);
		国家建筑全部.push(["书院", 0, 20, 200, 11]);
		//
		_root.国家建筑全部 = 国家建筑全部;
	}
}