class 数据库.外部外域美人 {
	public function 执行():Void {
		var 外域美人 = [];
		外域美人.push({d:0, id:900, 名称:"大长今", 能力:87, 跳:11, 介绍:"奇女子徐长今通过自己的努力成为朝鲜王朝历史上首位女性御医，被中宗赐“大长今”称号。"});
		外域美人.push({d:1, id:901, 名称:"静御前", 能力:94, 跳:15, 介绍:"静御前是日本平安时代末期的人物，矶禅师之女，源义经之爱妾，擅长跳舞。日本战国悲情三大美女之一。 "});
		外域美人.push({d:2, id:902, 名称:"耶律寒香", 能力:92, 跳:8, 介绍:"耶律阿保机之女，契丹美女。 "});
		外域美人.push({d:3, id:903, 名称:"楼兰", 能力:97, 跳:2, 介绍:"楼兰，丝绸之路上神秘女子。"});
		外域美人.push({d:4, id:904, 名称:"阿奴", 能力:90, 跳:6, 介绍:"在南诏土生土长的美女，巫月神教掌门。"});
		外域美人.push({d:5, id:905, 名称:"格来达瓦", 能力:92, 跳:9, 介绍:"古代西域美女，名字的意思是圣洁的月亮。"});
		外域美人.push({d:6, id:906, 名称:"善无续", 能力:88, 跳:17, 介绍:"阿育王的王后，温顺善良，信奉佛法，全身心的扶助阿育王。"});
		外域美人.push({d:7, id:907, 名称:"阿姬曼", 能力:92, 跳:16, 介绍:"沙杰汗的宠妃，一位具有波斯血统的绝世美女，性情温柔，擅诗琴书画。也就是泰姬陵的主人。"});
		外域美人.push({d:8, id:908, 名称:"阿史那冰", 能力:92, 跳:12, 介绍:"突厥贵族之女，突厥部落的著名美女。阿史那·冰。"});
		外域美人.push({d:9, id:909, 名称:"黛绮丝", 能力:92, 跳:10, 介绍:"具有传奇色彩的奇女子。明教四大法王之首“紫衫龙王”，同时是武林第一美人。。"});
		外域美人.push({d:10, id:910, 名称:"西尔维娅", 能力:96, 跳:14, 介绍:"古罗马神话，战神马耳斯的妻子。"});
		外域美人.push({d:11, id:911, 名称:"织田市", 能力:96, 跳:20, 介绍:"日本战国时代女性，父亲是织田信秀，母不详，长兄为织田信长。一般通称她为阿市夫人，或是小谷夫人，相传她有绝世美女的称号。"});
		外域美人.push({d:12, id:912, 名称:"宁宁", 能力:89, 跳:21, 介绍:"丰臣秀吉的糟糠之妻。秀吉操纵朝廷由武家升任为摄政关白，而宁宁也被尊称为“北政所”。"});
		外域美人.push({d:13, id:913, 名称:"赛玛噶", 能力:87, 跳:4, 介绍:"松赞干布的妹妹。嫁给了象雄王，象雄王宠爱另一个妃子而冷待赛玛噶。最后象雄被松赞干布灭了。"});
		外域美人.push({d:14, id:914, 名称:"托米丽丝", 能力:81, 跳:5, 介绍:"一位领军对抗波斯的为子报仇的年轻妃子。"});
		外域美人.push({d:15, id:915, 名称:"古儿别速", 能力:81, 跳:7, 介绍:"古儿别速原为乃蛮部汗王亦难察必勒格宠妃。乃蛮部灭亡后，被成吉思汗宠爱，封为皇后。"});
		//
		_root.外域美人 = 外域美人;
	}
}